In [1]:
import pandas as pd

In [2]:
df=pd.read_excel('housesales.xlsx')

In [3]:
df.head(2)

,sqft,hometype,beds,baths,lotsize,yearbulit,daysonmarket,parkingtype,zip,listprice
0,3040,Single Family Residential,4,3,54886,1961,349,1,80303,895.0
1,2920,Single Family Residential,3,3,38754,1966,81,1,80303,659.0

## basic statistics

df.mi(
df.max()
    df.sum()
    df.mean()
    df.count()
    df.std()
    df.var()
    df.quantile()
    df.median()
    df.describe()

In [4]:
df['listprice'].max()

7500.0

In [5]:
df['listprice'].std()

975.522562460288

In [6]:
df['listprice'].min()

127.969

In [7]:
df['listprice'].sum()

256256.35600000003

In [8]:
df['listprice'].median()

890.0

In [9]:
df['listprice'].quantile(0.50)

890.0

In [10]:
df['listprice'].quantile([0.25,0.50,0.75])

0.25     575.525
0.50     890.000
0.75    1390.500
Name: listprice, dtype: float64

In [11]:
df.mean()

sqft             3116.486364
beds                3.536364
baths               2.945455
lotsize         25296.900000
yearbulit        1977.745455
daysonmarket       84.495455
parkingtype         0.900000
zip             80303.109091
listprice        1164.801618
dtype: float64

In [12]:
df.min()

sqft                466
hometype          Condo
beds                  1
baths                 1
lotsize               1
yearbulit          1880
daysonmarket          1
parkingtype           0
zip               80301
listprice       127.969
dtype: object

In [13]:
df.max()

sqft                10466
hometype        Townhouse
beds                    6
baths                   6
lotsize            435600
yearbulit            2015
daysonmarket         1308
parkingtype             1
zip                 80305
listprice            7500
dtype: object

In [14]:
df.count()## number of non empy rows

sqft            220
hometype        220
beds            220
baths           220
lotsize         220
yearbulit       220
daysonmarket    220
parkingtype     220
zip             220
listprice       220
dtype: int64

### groupby

df.groupby(by='colname' )

In [16]:
df.head(1)

,sqft,hometype,beds,baths,lotsize,yearbulit,daysonmarket,parkingtype,zip,listprice
0,3040,Single Family Residential,4,3,54886,1961,349,1,80303,895.0

In [20]:
d=df.groupby(by='hometype').mean()

In [21]:
d

,sqft,beds,baths,lotsize,yearbulit,daysonmarket,parkingtype,zip,listprice
hometype,,,,,,,,,
Condo,1483.162162,1.756757,2.027027,24948.459459,1995.189189,151.243243,0.891892,80302.810811,588.209946
Single Family Residential,3520.982955,3.943182,3.159091,26150.062500,1973.778409,73.465909,0.897727,80303.193182,1313.724932
Townhouse,1579.571429,2.714286,2.428571,5687.714286,1985.285714,9.000000,1.000000,80302.571429,468.142857

In [23]:
df.groupby(by='hometype')['sqft','listprice','lotsize'].mean()

                                  sqft    listprice       lotsize
hometype
Condo                      1483.162162   588.209946  24948.459459
Single Family Residential  3520.982955  1313.724932  26150.062500
Townhouse                  1579.571429   468.142857   5687.714286

In [24]:
df.head(2)

,sqft,hometype,beds,baths,lotsize,yearbulit,daysonmarket,parkingtype,zip,listprice
0,3040,Single Family Residential,4,3,54886,1961,349,1,80303,895.0
1,2920,Single Family Residential,3,3,38754,1966,81,1,80303,659.0

In [29]:
## caluculate zip baths avg listprice
df.groupby(by=['zip','baths'])['listprice'].sum()

zip    baths
80301  1          129.900
       2         1863.850
       3         5545.038
       4         5491.600
       5         2919.000
80302  1         4854.150
       2        18534.800
       3        28198.600
       4        15008.000
       5         7084.000
       6         3875.000
80303  1         2294.399
       2         9466.200
       3         8664.100
       4         5903.000
       5         9289.000
       6         1965.000
80304  1         3442.369
       2        12562.300
       3        28600.750
       4        30820.400
       5         9586.000
       6        20430.000
80305  1          889.000
       2         5402.600
       3         7492.300
       4         3150.000
       5         2795.000
Name: listprice, dtype: float64

In [30]:
import numpy as np

In [34]:
df.groupby(by=['hometype','zip'])['listprice'].agg(['mean','sum','min','max'])

                                        mean        sum      min      max
hometype                  zip
Condo                     80301   182.375000    364.750  129.900   234.85
                          80302   731.179167   8774.150  162.400  1950.00
                          80303   385.921357   5402.899  138.500  1389.00
                          80304   802.441000   7221.969  127.969  1375.00
Single Family Residential 80301   870.625765  14800.638  319.500  2399.00
                          80302  1613.842857  67781.400  575.000  4250.00
                          80303  1134.278571  31759.800  449.900  6499.00
                          80304  1434.703676  97559.850  485.000  7500.00
                          80305   919.709524  19313.900  410.000  2795.00
Townhouse                 80301   392.000000    784.000  369.000   415.00
                          80302   499.500000    999.000  474.000   525.00
                          80303   419.000000    419.000  419.000   419.00
                          80304   660.000000    660.000  660.000   660.00
                          80305   415.000000    415.000  415.000   415.00

df.describe

pivot table

pd.pivot_tabel(data,values=none,
              index=none,
              columns=none,aggfunc=)

In [38]:
pd.pivot_table(df,values='listprice',index='hometype')

                             listprice
hometype
Condo                       588.209946
Single Family Residential  1313.724932
Townhouse                   468.142857

In [43]:
pd.pivot_table(df,values='listprice',columns='parkingtype')

parkingtype           0            1
listprice    758.936364  1209.897758

In [42]:
pd.pivot_table(df,values=['listprice','sqft'],index='hometype',columns='parkingtype')

                            listprice                      sqft
parkingtype                         0            1            0            1
hometype
Condo                      185.100000   637.071758   678.000000  1580.757576
Single Family Residential  886.455556  1362.401190  1966.111111  3698.120253
Townhouse                         NaN   468.142857          NaN  1579.571429

dffg

In [44]:
df.head(2)

,sqft,hometype,beds,baths,lotsize,yearbulit,daysonmarket,parkingtype,zip,listprice
0,3040,Single Family Residential,4,3,54886,1961,349,1,80303,895.0
1,2920,Single Family Residential,3,3,38754,1966,81,1,80303,659.0

In [48]:
##minimum days on the market by home type
pd.pivot_table(data=df,values='daysonmarket',index='hometype',aggfunc=np.min)

                           daysonmarket
hometype
Condo                                 3
Single Family Residential             1
Townhouse                             2